cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51N20A.svd
        <register>
          <name>REFCTRL</name>
          <description>Reference Control</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>REFSEL</name>
              <description>Reference Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>REFSELSelect</name>
                <enumeratedValue>
                  <name>INTREF</name>
                  <description>Internal Bandgap Reference</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTVCC0</name>
                  <description>1/2 VDDANA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTVCC1</name>
                  <description>VDDANA</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREFA</name>
                  <description>External Reference</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREFB</name>
                  <description>External Reference</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AREFC</name>
                  <description>External Reference (only on ADC1)</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFCOMP</name>
              <description>Reference Buffer Offset Compensation Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>AVGCTRL</name>
          <description>Average Control</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SAMPLENUM</name>
              <description>Number of Samples to be Collected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>SAMPLENUMSelect</name>
                <enumeratedValue>
                  <name>1</name>
                  <description>1 sample</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>2 samples</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>4 samples</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 samples</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 samples</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 samples</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 samples</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128 samples</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 samples</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 samples</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>1024 samples</description>
                  <value>0xa</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADJRES</name>
              <description>Adjusting Result / Division Coefficient</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SAMPCTRL</name>
          <description>Sample Time Control</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SAMPLEN</name>
              <description>Sampling Time Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>OFFCOMP</name>
              <description>Comparator Offset Compensation Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINLT</name>
          <description>Window Monitor Lower Threshold</description>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WINLT</name>
              <description>Window Lower Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>WINUT</name>
          <description>Window Monitor Upper Threshold</description>
          <addressOffset>0x0E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>WINUT</name>
              <description>Window Upper Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GAINCORR</name>
          <description>Gain Correction</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>GAINCORR</name>
              <description>Gain Correction Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>OFFSETCORR</name>
          <description>Offset Correction</description>
          <addressOffset>0x12</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>OFFSETCORR</name>
              <description>Offset Correction Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SWTRIG</name>
          <description>Software Trigger</description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>FLUSH</name>
              <description>ADC Conversion Flush</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>START</name>
              <description>Start ADC Conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x2C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Overrun Interrupt Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMON</name>
              <description>Window Monitor Interrupt Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x2D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Overrun Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMON</name>
              <description>Window Monitor Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x2E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>RESRDY</name>
              <description>Result Ready Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OVERRUN</name>
              <description>Overrun Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINMON</name>
              <description>Window Monitor Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status</description>
          <addressOffset>0x2F</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ADCBUSY</name>
              <description>ADC Busy Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WCC</name>
              <description>Window Comparator Counter</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>SWRST Synchronization Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>ENABLE Synchronization Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INPUTCTRL</name>
              <description>Input Control Synchronization Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTRLB</name>
              <description>Control B Synchronization Busy</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REFCTRL</name>
              <description>Reference Control Synchronization Busy</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVGCTRL</name>
              <description>Average Control Synchronization Busy</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAMPCTRL</name>
              <description>Sampling Time Control Synchronization Busy</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WINLT</name>
              <description>Window Monitor Lower Threshold Synchronization Busy</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WINUT</name>
              <description>Window Monitor Upper Threshold Synchronization Busy</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GAINCORR</name>
              <description>Gain Correction Synchronization Busy</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OFFSETCORR</name>
              <description>Offset Correction Synchronization Busy</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SWTRIG</name>
              <description>Software Trigger Synchronization Busy</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSEQDATA</name>
          <description>DMA Sequencial Data</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATA</name>
              <description>DMA Sequential Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSEQCTRL</name>
          <description>DMA Sequential Control</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>INPUTCTRL</name>
              <description>Input Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CTRLB</name>
              <description>Control B</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>REFCTRL</name>
              <description>Reference Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AVGCTRL</name>
              <description>Average Control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SAMPCTRL</name>
              <description>Sampling Time Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINLT</name>
              <description>Window Monitor Lower Threshold</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WINUT</name>
              <description>Window Monitor Upper Threshold</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GAINCORR</name>
              <description>Gain Correction</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OFFSETCORR</name>
              <description>Offset Correction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AUTOSTART</name>
              <description>ADC Auto-Start Conversion</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DSEQSTAT</name>
          <description>DMA Sequencial Status</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>INPUTCTRL</name>
              <description>Input Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CTRLB</name>
              <description>Control B</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REFCTRL</name>
              <description>Reference Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVGCTRL</name>
              <description>Average Control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAMPCTRL</name>
              <description>Sampling Time Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WINLT</name>
              <description>Window Monitor Lower Threshold</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WINUT</name>
              <description>Window Monitor Upper Threshold</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GAINCORR</name>
              <description>Gain Correction</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OFFSETCORR</name>
              <description>Offset Correction</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>DMA Sequencing Busy</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESULT</name>
          <description>Result Conversion Value</description>
          <addressOffset>0x40</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESULT</name>
              <description>Result Conversion Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RESS</name>
          <description>Last Sample Result</description>
          <addressOffset>0x44</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>RESS</name>
              <description>Last ADC conversion result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CALIB</name>
          <description>Calibration</description>
          <addressOffset>0x48</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>BIASCOMP</name>
              <description>Bias Comparator Scaling</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BIASR2R</name>
              <description>Bias R2R Ampli scaling</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>BIASREFBUF</name>
              <description>Bias  Reference Buffer Scaling</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
          </fields>
        </register>
