cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51N20A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DSU</name>
      <version>1.0.0</version>
      <description>Device Service Unit</description>
      <groupName>DSU</groupName>
      <prependToName>DSU_</prependToName>
      <baseAddress>0x41002000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x2000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control</description>
          <addressOffset>0x0000</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CRC</name>
              <description>32-bit Cyclic Redundancy Code</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MBIST</name>
              <description>Memory built-in self-test</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CE</name>
              <description>Chip-Erase</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ARR</name>
              <description>Auxiliary Row Read</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SMSA</name>
              <description>Start Memory Stream Access</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSA</name>
          <description>Status A</description>
          <addressOffset>0x0001</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DONE</name>
              <description>Done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CRSTEXT</name>
              <description>CPU Reset Phase Extension</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BERR</name>
              <description>Bus Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FAIL</name>
              <description>Failure</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PERR</name>
              <description>Protection Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUSB</name>
          <description>Status B</description>
          <addressOffset>0x0002</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PROT</name>
              <description>Protected</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBGPRES</name>
              <description>Debugger Present</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCCD0</name>
              <description>Debug Communication Channel 0 Dirty</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCCD1</name>
              <description>Debug Communication Channel 1 Dirty</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HPE</name>
              <description>Hot-Plugging Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CELCK</name>
              <description>Chip Erase Locked</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TDCCD0</name>
              <description>Test Debug Communication Channel 0 Dirty</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TDCCD1</name>
              <description>Test Debug Communication Channel 1 Dirty</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDR</name>
          <description>Address</description>
          <addressOffset>0x0004</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>AMOD</name>
              <description>Access Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>ADDR</name>
              <description>Address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LENGTH</name>
          <description>Length</description>
          <addressOffset>0x0008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LENGTH</name>
              <description>Length</description>
              <bitOffset>2</bitOffset>
              <bitWidth>30</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA</name>
          <description>Data</description>
          <addressOffset>0x000C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DCC%s</name>
          <description>Debug Communication Channel n</description>
          <addressOffset>0x0010</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DID</name>
          <description>Device Identification</description>
          <addressOffset>0x0018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x60060302</resetValue>
          <fields>
            <field>
              <name>DEVSEL</name>
              <description>Device Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Revision Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DIE</name>
              <description>Die Number</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SERIES</name>
              <description>Series</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>SERIESSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>Cortex-M0+ processor, basic feature set</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>Cortex-M0+ processor, USB</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FAMILY</name>
              <description>Family</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>FAMILYSelect</name>
                <enumeratedValue>
                  <name>0</name>
                  <description>General purpose microcontroller</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>PicoPower</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROCESSOR</name>
              <description>Processor</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>PROCESSORSelect</name>
                <enumeratedValue>
                  <name>CM0P</name>
                  <description>Cortex-M0+</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM23</name>
                  <description>Cortex-M23</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM3</name>
                  <description>Cortex-M3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM4</name>
                  <description>Cortex-M4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM4F</name>
                  <description>Cortex-M4 with FPU</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM33</name>
                  <description>Cortex-M33</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Configuration</description>
          <addressOffset>0x001C</addressOffset>
          <size>32</size>
          <resetValue>0x00000002</resetValue>
          <fields>
            <field>
              <name>LQOS</name>
              <description>Latency Quality Of Service</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>DCCDMALEVEL</name>
              <description>DMA Trigger Level</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>DCCDMALEVELSelect</name>
                <enumeratedValue>
                  <name>EMPTY</name>
                  <description>Trigger rises when DCC is empty</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULL</name>
                  <description>Trigger rises when DCC is full</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETBRAMEN</name>
              <description>Trace Control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>DCFG%s</name>
          <description>Device Configuration</description>
          <addressOffset>0x00F0</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DCFG</name>
              <description>Device Configuration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ENTRY0</name>
          <description>CoreSight ROM Table Entry 0</description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x9F0FC002</resetValue>
          <fields>
            <field>
              <name>EPRES</name>
              <description>Entry Present</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FMT</name>
              <description>Format</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDOFF</name>
              <description>Address Offset</description>
              <bitOffset>12</bitOffset>
              <bitWidth>20</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ENTRY1</name>
          <description>CoreSight ROM Table Entry 1</description>
          <addressOffset>0x1004</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>END</name>
          <description>CoreSight ROM Table End</description>
          <addressOffset>0x1008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>END</name>
              <description>End Marker</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MEMTYPE</name>
          <description>CoreSight ROM Table Memory Type</description>
          <addressOffset>0x1FCC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SMEMP</name>
              <description>System Memory Present</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PID4</name>
          <description>Peripheral Identification 4</description>
          <addressOffset>0x1FD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>JEPCC</name>
              <description>JEP-106 Continuation Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>FKBC</name>
              <description>4KB count</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PID5</name>
          <description>Peripheral Identification 5</description>
          <addressOffset>0x1FD4</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID6</name>
          <description>Peripheral Identification 6</description>
          <addressOffset>0x1FD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID7</name>
          <description>Peripheral Identification 7</description>
          <addressOffset>0x1FDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
        </register>
        <register>
          <name>PID0</name>
          <description>Peripheral Identification 0</description>
          <addressOffset>0x1FE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000D0</resetValue>
          <fields>
            <field>
              <name>PARTNBL</name>
              <description>Part Number Low</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PID1</name>
          <description>Peripheral Identification 1</description>
          <addressOffset>0x1FE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000FC</resetValue>
          <fields>
            <field>
              <name>PARTNBH</name>
              <description>Part Number High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>JEPIDCL</name>
              <description>Low part of the JEP-106 Identity Code</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PID2</name>
          <description>Peripheral Identification 2</description>
          <addressOffset>0x1FE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000009</resetValue>
          <fields>
            <field>
              <name>JEPIDCH</name>
              <description>JEP-106 Identity Code High</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>JEPU</name>
              <description>JEP-106 Identity Code is used</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REVISION</name>
              <description>Revision Number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PID3</name>
          <description>Peripheral Identification 3</description>
          <addressOffset>0x1FEC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CUSMOD</name>
              <description>ARM CUSMOD</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>REVAND</name>
              <description>Revision Number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID0</name>
          <description>Component Identification 0</description>
          <addressOffset>0x1FF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <fields>
            <field>
              <name>PREAMBLEB0</name>
              <description>Preamble Byte 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID1</name>
          <description>Component Identification 1</description>
          <addressOffset>0x1FF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000010</resetValue>
          <fields>
            <field>
              <name>PREAMBLE</name>
              <description>Preamble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCLASS</name>
              <description>Component Class</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID2</name>
          <description>Component Identification 2</description>
          <addressOffset>0x1FF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <fields>
            <field>
              <name>PREAMBLEB2</name>
              <description>Preamble Byte 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CID3</name>
          <description>Component Identification 3</description>
          <addressOffset>0x1FFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <fields>
            <field>
              <name>PREAMBLEB3</name>
              <description>Preamble Byte 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
