cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51N20A.svd
        <register>
          <name>INSTRFRAME</name>
          <description>Instruction Frame</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WIDTH</name>
              <description>Instruction Code, Address, Option Code and Data Width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>WIDTHSelect</name>
                <enumeratedValue>
                  <name>SINGLE_BIT_SPI</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Single-bit SPI</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_OUTPUT</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Dual SPI</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_OUTPUT</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Single-bit SPI / Data: Quad SPI</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_IO</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Dual SPI / Data: Dual SPI</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_IO</name>
                  <description>Instruction: Single-bit SPI / Address-Option: Quad SPI / Data: Quad SPI</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DUAL_CMD</name>
                  <description>Instruction: Dual SPI / Address-Option: Dual SPI / Data: Dual SPI</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUAD_CMD</name>
                  <description>Instruction: Quad SPI / Address-Option: Quad SPI / Data: Quad SPI</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSTREN</name>
              <description>Instruction Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDREN</name>
              <description>Address Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTCODEEN</name>
              <description>Option Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DATAEN</name>
              <description>Data Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OPTCODELEN</name>
              <description>Option Code Length</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>OPTCODELENSelect</name>
                <enumeratedValue>
                  <name>1BIT</name>
                  <description>1-bit length option code</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2BITS</name>
                  <description>2-bits length option code</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4BITS</name>
                  <description>4-bits length option code</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8BITS</name>
                  <description>8-bits length option code</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRLEN</name>
              <description>Address Length</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ADDRLENSelect</name>
                <enumeratedValue>
                  <name>24BITS</name>
                  <description>24-bits address length</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BITS</name>
                  <description>32-bits address length</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFRTYPE</name>
              <description>Data Transfer Type</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TFRTYPESelect</name>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read transfer from the serial memory.Scrambling is not performed.Read at random location (fetch) in the serial flash memory is not possible.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READMEMORY</name>
                  <description>Read data transfer from the serial memory.If enabled, scrambling is performed.Read at random location (fetch) in the serial flash memory is possible.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write transfer into the serial memory.Scrambling is not performed.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITEMEMORY</name>
                  <description>Write data transfer into the serial memory.If enabled, scrambling is performed.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CRMODE</name>
              <description>Continuous Read Mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DDREN</name>
              <description>Double Data Rate Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DUMMYLEN</name>
              <description>Dummy Cycles Length</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRAMBCTRL</name>
          <description>Scrambling Mode</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Scrambling/Unscrambling Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RANDOMDIS</name>
              <description>Scrambling/Unscrambling Random Value Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SCRAMBKEY</name>
          <description>Scrambling Key</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEY</name>
              <description>Scrambling User Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
