cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51N20A.svd
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>BKUP%s</name>
          <description>Backup</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BKUP</name>
              <description>Backup</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
       </cluster> <!-- RtcMode2 -->
      </registers>
    </peripheral>
    <peripheral>
      <name>SDHC0</name>
      <version>1.8.3</version>
      <description>SD/MMC Host Controller 0</description>
      <groupName>SDHC</groupName>
      <prependToName>SDHC_</prependToName>
      <baseAddress>0x45000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00000C00</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SDHC0</name>
        <value>135</value>
      </interrupt>
      <registers>
        <register>
          <name>SSAR</name>
          <description>SDMA System Address / Argument 2</description>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ADDR</name>
              <description>SDMA System Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SSAR_CMD23</name>
          <description>SDMA System Address / Argument 2</description>
          <alternateRegister>SSAR</alternateRegister>
          <addressOffset>0x000</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARG2</name>
              <description>Argument 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BSR</name>
          <description>Block Size</description>
          <addressOffset>0x004</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>BLOCKSIZE</name>
              <description>Transfer Block Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
            </field>
            <field>
              <name>BOUNDARY</name>
              <description>SDMA Buffer Boundary</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>BOUNDARYSelect</name>
                <enumeratedValue>
                  <name>4K</name>
                  <description>4k bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8K</name>
                  <description>8k bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16K</name>
                  <description>16k bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32K</name>
                  <description>32k bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64K</name>
                  <description>64k bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128K</name>
                  <description>128k bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256K</name>
                  <description>256k bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512K</name>
                  <description>512k bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BCR</name>
          <description>Block Count</description>
          <addressOffset>0x006</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>BCNT</name>
              <description>Blocks Count for Current Transfer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>ARG1R</name>
          <description>Argument 1</description>
          <addressOffset>0x008</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>ARG</name>
              <description>Argument 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>TMR</name>
          <description>Transfer Mode</description>
          <addressOffset>0x00C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DMAENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>No data transfer or Non DMA data transfer</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>DMA data transfer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BCEN</name>
              <description>Block Count Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BCENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMDEN</name>
              <description>Auto Command Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ACMDENSelect</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Auto Command Disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD12</name>
                  <description>Auto CMD12 Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD23</name>
                  <description>Auto CMD23 Enable</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTDSEL</name>
              <description>Data Transfer Direction Selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DTDSELSelect</name>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write (Host to Card)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read (Card to Host)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MSBSEL</name>
              <description>Multi/Single Block Selection</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MSBSELSelect</name>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Single Block</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTIPLE</name>
                  <description>Multiple Block</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>Command</description>
          <addressOffset>0x00E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>RESPTYP</name>
              <description>Response Type</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RESPTYPSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No response</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>136_BIT</name>
                  <description>136-bit response</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48_BIT</name>
                  <description>48-bit response</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48_BIT_BUSY</name>
                  <description>48-bit response check busy after response</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDCCEN</name>
              <description>Command CRC Check Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDCCENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDICEN</name>
              <description>Command Index Check Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDICENSelect</name>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPSEL</name>
              <description>Data Present Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DPSELSelect</name>
                <enumeratedValue>
                  <name>NO_DATA</name>
                  <description>No Data Present</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA</name>
                  <description>Data Present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDTYP</name>
              <description>Command Type</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CMDTYPSelect</name>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Other commands</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>CMD52 for writing Bus Suspend in CCCR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>CMD52 for writing Function Select in CCCR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ABORT</name>
                  <description>CMD12, CMD52 for writing I/O Abort in CCCR</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDIDX</name>
              <description>Command Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RR%s</name>
          <description>Response</description>
          <addressOffset>0x010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CMDRESP</name>
              <description>Command Response</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BDPR</name>
          <description>Buffer Data Port</description>
          <addressOffset>0x020</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>BUFDATA</name>
              <description>Buffer Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
